{
  "footer": {
    "brandName": "BodyState",
    "quickLinks": "Hurtige links",
    "homeLink": "Hjem",
    "faqLink": "Ofte stillede spørgsmål",
    "contactLink": "Kontakt os",
    "appStoreLink": "App Store",
    "legal": "Lovligt",
    "privacyPolicyLink": "Fortrolighedspolitik",
    "termsOfServiceLink": "Servicevilkår",
    "connect": "Forbind",
    "twitterLink": "Twitter",
    "instagramLink": "Instagram",
    "tiktokLink": "TikTok",
    "resources": "Ressourcer",
    "blogLink": "Blog",
    "supportLink": "Støtte",
    "careersLink": "Karriere",
    "copyright": "© {year} BodyState by 2001 Ventures AS. All rights reserved."
  },
  "header": {
    "brandName": "BodyState",
    "homeLink": "Hjem",
    "faqLink": "Ofte stillede spørgsmål",
    "contactLink": "Kontakt",
    "downloadButton": "Hent"
  },
  "privacyPolicy": {
    "pageTitle": "Fortrolighedspolitik",
    "h1_1": "Fortrolighed",
    "p1_1": "Hos BodyState værdsætter vi din fortrolighed og er forpligtet til at beskytte dine personlige data. Denne fortrolighedspolitik forklarer, hvordan BodyState indsamler, behandler og beskytter dine data i overensstemmelse med gældende databeskyttelseslove, herunder den generelle databeskyttelsesforordning (GDPR).",
    "h2_1": "Centrale principper",
    "li1_1": "Ingen personligt identificerbare oplysninger (PII): BodyState indsamler ikke eller gemmer nogen data, der direkte kan identificere dig, såsom navne, e-mailadresser eller fysiske adresser.",
    "li1_2": "Anonym databehandling: Alle indsamlede data anonymiseres og kan ikke tilknyttes specifikke personer.",
    "li1_3": "Data-minimering: Vi indsamler kun de data, der er strengt nødvendige for at forbedre appens ydeevne og funktionalitet.",
    "li1_4": "Ingen datadeling: Vi deler ikke brugerdata med tredjeparter til reklame eller andre ikke-funktionelle formål.",
    "h2_2": "1. Data vi indsamler",
    "p2_1": "Vi indsamler anonymiserede data med henblik på app-funktionalitet, diagnostik og ydeevneanalyse. Dette inkluderer:",
    "h3_2_1": "a. Nedbrudsrapportering og diagnostik",
    "p2_2": "Værktøj: Sentry. Formål: At overvåge appens ydeevne, identificere nedbrud og sikre, at appen fungerer pålideligt. Data indsamlet: Diagnostiske data såsom nedbrudslogs og ydelsesmålinger. Anonymisering: Data indsamlet af Sentry er anonyme og kan ikke tilknyttes specifikke brugere. Der indsamles eller gemmes ingen personlige data. Dataopbevaring: EU-region",
    "h3_2_2": "b. Analytics",
    "p2_3": "Værktøj: PostHog. Formål: At analysere brugerinteraktioner og forbedre appens ydeevne. Data indsamlet: Interaktionsbegivenheder (f.eks. funktioner) og ydelsesmålinger. Anonymisering: Alle data er anonymiserede; ingen PII fanges, gemmes eller behandles. Dataopbevaring: EU-region",
    "h3_2_3": "c. Køb i appen",
    "p2_4": "Værktøj: RevenueCat. Formål: At administrere abonnementer og køb i appen. Data indsamlet: Enhedsidentifikatorer og købsoplysninger (f.eks. abonnementstype). Anonymisering: Ingen personlige identifikatorer (f.eks. navne eller e-mails) er forbundet med transaktionsdata.",
    "h2_3": "2. Dataopbevaring og sletning",
    "h3_3_1": "Dataopbevaring",
    "p3_1": "Alle data indsamlet af BodyState er anonymiserede, aggregerede og bruges kun til at forbedre appens funktionalitet og sikre ydelsesstabilitet. Som sådan opbevares individuelle datapunkter kun så længe det er nødvendigt for disse formål og i overensstemmelse med vores tredjeparts tjenesters opbevaringspolitikker.",
    "h3_3_2": "Datasletning",
    "p3_2": "Hvis du ikke længere ønsker, at BodyState skal indsamle eller behandle dine data:",
    "p3_3": "Kan du slette appen fra din enhed. Ved at slette appen stoppes al fremtidig dataindsamling, da ingen data opbevares uden for de tredjepartsværktøjer, der er integreret i BodyState.",
    "h2_4": "3. Ændringer i denne fortrolighedspolitik",
    "p4_1": "Vi kan opdatere denne fortrolighedspolitik fra tid til anden for at afspejle ændringer i vores praksis, juridiske krav eller appfunktionalitet. Alle opdateringer vil blive offentliggjort på denne side, og datoen for \"Sidst opdateret\" vil blive revideret i overensstemmelse hermed.",
    "h2_5": "4. Kontakt os",
    "p5_1": "Hvis du har spørgsmål eller bekymringer vedrørende denne fortrolighedspolitik eller hvordan dine data behandles, bedes du kontakte os {contactLink}.",
    "contactLinkText": "her"
  },
  "termsOfService": {
    "pageTitle": "Servicevilkår",
    "h1_1": "Servicevilkår",
    "h2_1": "1. Introduktion",
    "p1_1": "Disse Servicevilkår (\"Vilkår\") styrer din brug af køb i appen tilgængelig inden for BodyState-appen (\"App\"). Ved at foretage et køb i appen accepterer du at være bundet af disse Vilkår.",
    "h2_2": "2. Køb i Appen",
    "p2_1": "Appen tilbyder forskellige køb i appen, såsom temaer, der kan forbedre din oplevelse. Alle køb i appen er engangstransaktioner. Når et køb er gennemført, er det ikke-refunderbart, medmindre det kræves ved lov.",
    "h2_3": "3. Funktionalitet",
    "p3_1": "Hvis funktionaliteten af et køb i appen, såsom et tema, går tabt eller forstyrres, kan du gendanne dit køb. For at gøre dette skal du blot gennemgå købsprocessen igen og bruge knappen \"Gendan Køb\" på betalingsvæggen for at få adgang igen uden ekstra omkostninger.",
    "h2_4": "4. Licens",
    "p4_1": "Når du foretager et køb i appen, får du tildelt en ikke-eksklusiv, ikke-overførbar, tilbagekaldelig licens til at bruge det købte indhold inden for Appen. Denne licens er kun til personlig brug og giver ikke nogen ejendomsrettigheder i det købte indhold.",
    "h2_5": "5. Opdateringer og Ændringer",
    "p5_1": "BodyState forbeholder sig retten til at opdatere eller ændre køb i appen, herunder men ikke begrænset til temaer, når som helst. Mens vi stræber efter at vedligeholde funktionaliteten af alt købt indhold, garanterer vi ikke, at det forbliver uændret eller tilgængeligt på ubestemt tid. Opdateringer vil blive leveret uden ekstra omkostninger.",
    "h2_6": "6. Ophør",
    "p6_1": "BodyState forbeholder sig retten til at ophæve eller suspendere din adgang til eventuelle køb i appen, hvis du overtræder disse Vilkår eller engagerer dig i uautoriseret brug af indholdet.",
    "h2_7": "7. Ansvarsbegrænsning",
    "p7_1": "I det omfang loven tillader det, er BodyState ikke ansvarlig for direkte, indirekte, tilfældige eller følgeskader, der opstår fra din brug af køb i appen, herunder eventuel tab af funktionalitet.",
    "h2_8": "8. Lovvalg",
    "p8_1": "Disse Vilkår er underlagt og fortolkes i overensstemmelse med Norges love. Enhver tvist, der opstår fra disse Vilkår, vil blive løst i Norges domstole.",
    "h2_9": "9. Kontaktinformation",
    "p9_1": "Hvis du har spørgsmål eller bekymringer vedrørende disse Vilkår, bedes du kontakte os {contactLink}.",
    "contactLinkText": "her"
  }
}