{
  "footer": {
    "brandName": "BodyState",
    "quickLinks": "Schnelle Links",
    "homeLink": "Zuhause",
    "faqLink": "Häufig gestellte Fragen",
    "contactLink": "Kontaktiere uns",
    "appStoreLink": "App Store",
    "legal": "Rechtliches",
    "privacyPolicyLink": "Datenschutzbestimmungen",
    "termsOfServiceLink": "Nutzungsbedingungen",
    "connect": "Verbinden",
    "twitterLink": "Twitter",
    "instagramLink": "Instagram",
    "tiktokLink": "TikTok",
    "resources": "Ressourcen",
    "blogLink": "Blog",
    "supportLink": "Unterstützung",
    "careersLink": "Karrieren",
    "copyright": "© {year} BodyState von 2001 Ventures AS. Alle Rechte vorbehalten.",
    "madeWithLove": "Mit ❤️ in {location} gemacht von",
    "copyrightShort": "© {year}",
    "locationNorway": "Norwegen",
    "locationEurope": "Europa"
  },
  "header": {
    "brandName": "BodyState",
    "homeLink": "Zuhause",
    "faqLink": "Häufig gestellte Fragen",
    "contactLink": "Kontakt",
    "downloadButton": "Herunterladen"
  },
  "privacyPolicy": {
    "pageTitle": "Datenschutzrichtlinie",
    "h1_1": "Datenschutz",
    "p1_1": "Bei BodyState legen wir Wert auf Ihre Privatsphäre und verpflichten uns, Ihre persönlichen Daten zu schützen. Diese Datenschutzrichtlinie erläutert, wie BodyState Ihre Daten gemäß geltenden Datenschutzgesetzen, einschließlich der Datenschutz-Grundverordnung (DSGVO), erhebt, verarbeitet und schützt.",
    "h2_1": "Wesentliche Grundsätze",
    "li1_1": "Keine persönlich identifizierbaren Informationen (PII): BodyState erhebt oder speichert keine Daten, die Sie direkt identifizieren können, wie Namen, E-Mail-Adressen oder physische Adressen.",
    "li1_2": "Anonyme Datenverarbeitung: Alle erhobenen Daten werden anonymisiert und können nicht mit bestimmten Personen in Verbindung gebracht werden.",
    "li1_3": "Datenminimierung: Wir erheben nur die für die Verbesserung der App-Performance und Funktionalität unbedingt erforderlichen Daten.",
    "li1_4": "Keine Datenweitergabe: Wir geben keine Benutzerdaten an Dritte zu Werbe- oder anderen nicht funktionalen Zwecken weiter.",
    "h2_2": "1. Erhobene Daten",
    "p2_1": "Wir erheben anonymisierte Daten für Zwecke der App-Funktionalität, Diagnose und Leistungsanalyse. Dazu gehören:",
    "h3_2_1": "a. Fehlerberichterstattung und Diagnose",
    "p2_2": "Tool: Sentry. Zweck: Überwachung der App-Performance, Identifizierung von Abstürzen und Sicherstellung der zuverlässigen App-Funktionalität. Erhobene Daten: Diagnosedaten wie Absturzprotokolle und Leistungsmetriken. Anonymisierung: Von Sentry erhobene Daten sind anonym und können nicht mit bestimmten Benutzern in Verbindung gebracht werden. Es werden keine persönlichen Daten erhoben oder gespeichert. Datenspeicherung: EU-Region",
    "h3_2_2": "b. Analytik",
    "p2_3": "Tool: PostHog. Zweck: Analyse von Benutzerinteraktionen und Verbesserung der App-Performance. Erhobene Daten: Interaktionsereignisse (z. B. Funktionsnutzung) und Leistungsmetriken. Anonymisierung: Alle Daten sind anonymisiert; es werden keine PII erfasst, gespeichert oder verarbeitet. Datenspeicherung: EU-Region",
    "h3_2_3": "c. In-App-Käufe",
    "p2_4": "Tool: RevenueCat. Zweck: Verwaltung von Abonnements und In-App-Käufen. Erhobene Daten: Gerätekennungen und Kaufdetails (z. B. Abonnementtyp). Anonymisierung: Keine persönlichen Identifikatoren (z. B. Namen oder E-Mails) werden mit Transaktionsdaten in Verbindung gebracht.",
    "h2_3": "2. Datenspeicherung und Löschung",
    "h3_3_1": "Datenspeicherung",
    "p3_1": "Alle von BodyState erhobenen Daten werden anonymisiert, aggregiert und ausschließlich zur Verbesserung der App-Funktionalität und Sicherstellung der Leistungsstabilität verwendet. Einzelne Datenpunkte werden nur so lange aufbewahrt, wie dies für diese Zwecke erforderlich ist und gemäß den Aufbewahrungspolicen unserer Drittanbieterdienste.",
    "h3_3_2": "Datenlöschung",
    "p3_2": "Wenn Sie nicht mehr möchten, dass BodyState Ihre Daten erhebt oder verarbeitet:",
    "p3_3": "Sie können die App von Ihrem Gerät löschen. Durch das Löschen der App wird die zukünftige Datenerhebung gestoppt, da keine Daten außerhalb der in BodyState integrierten Drittanbieter-Tools gespeichert werden.",
    "h2_4": "3. Änderungen dieser Datenschutzrichtlinie",
    "p4_1": "Wir können diese Datenschutzrichtlinie von Zeit zu Zeit aktualisieren, um Änderungen in unseren Praktiken, rechtlichen Anforderungen oder App-Funktionalitäten widerzuspiegeln. Alle Aktualisierungen werden auf dieser Seite veröffentlicht, und das Datum der „Letzten Aktualisierung“ wird entsprechend überarbeitet.",
    "h2_5": "4. Kontaktieren Sie uns",
    "p5_1": "Wenn Sie Fragen oder Bedenken zu dieser Datenschutzrichtlinie oder zur Handhabung Ihrer Daten haben, kontaktieren Sie uns bitte {contactLink}.",
    "contactLinkText": "hier"
  },
  "termsOfService": {
    "pageTitle": "Nutzungsbedingungen",
    "h1_1": "Nutzungsbedingungen",
    "h2_1": "1. Einführung",
    "p1_1": "Diese Nutzungsbedingungen (\"Bedingungen\") regeln Ihre Nutzung von In-App-Käufen, die innerhalb der BodyState-App (\"App\") verfügbar sind. Durch einen In-App-Kauf erklären Sie sich mit diesen Bedingungen einverstanden.",
    "h2_2": "2. In-App-Käufe",
    "p2_1": "Die App bietet verschiedene In-App-Käufe, wie z.B. Themen, die Ihr Erlebnis verbessern können. Alle In-App-Käufe sind einmalige Transaktionen. Einmal abgeschlossene Käufe sind nicht erstattungsfähig, es sei denn, dies ist gesetzlich vorgeschrieben.",
    "h2_3": "3. Funktionalität",
    "p3_1": "Wenn die Funktionalität eines In-App-Kaufs, wie z.B. eines Themas, verloren geht oder gestört ist, können Sie Ihren Kauf wiederherstellen. Gehen Sie dazu einfach erneut durch den Kaufprozess und verwenden Sie die Schaltfläche \"Käufe wiederherstellen\" auf der Bezahlwand, um den Zugriff ohne zusätzliche Kosten wiederzuerlangen.",
    "h2_4": "4. Lizenz",
    "p4_1": "Durch einen In-App-Kauf erhalten Sie eine nicht-exklusive, nicht übertragbare, widerrufliche Lizenz zur Nutzung des gekauften Inhalts innerhalb der App. Diese Lizenz gilt nur für den persönlichen Gebrauch und gewährt keine Eigentumsrechte am gekauften Inhalt.",
    "h2_5": "5. Updates und Änderungen",
    "p5_1": "BodyState behält sich das Recht vor, In-App-Käufe, einschließlich, aber nicht beschränkt auf Themen, jederzeit zu aktualisieren oder zu ändern. Obwohl wir bestrebt sind, die Funktionalität aller gekauften Inhalte aufrechtzuerhalten, können wir nicht garantieren, dass sie unverändert bleiben oder unbegrenzt verfügbar sind. Updates werden ohne zusätzliche Kosten bereitgestellt.",
    "h2_6": "6. Beendigung",
    "p6_1": "BodyState behält sich das Recht vor, Ihren Zugriff auf In-App-Käufe zu beenden oder auszusetzen, wenn Sie gegen diese Bedingungen verstoßen oder unbefugt Inhalte nutzen.",
    "h2_7": "7. Haftungsbeschränkung",
    "p7_1": "BodyState haftet nach Maßgabe des gesetzlich Zulässigen nicht für direkte, indirekte, zufällige oder Folgeschäden, die sich aus Ihrer Nutzung von In-App-Käufen ergeben, einschließlich eines Verlusts an Funktionalität.",
    "h2_8": "8. Rechtswahl",
    "p8_1": "Diese Bedingungen unterliegen dem Recht von Norwegen und werden in Übereinstimmung mit diesem ausgelegt. Streitigkeiten aus diesen Bedingungen werden vor den Gerichten Norwegens beigelegt.",
    "h2_9": "9. Kontaktinformationen",
    "p9_1": "Wenn Sie Fragen oder Bedenken zu diesen Bedingungen haben, kontaktieren Sie uns bitte {contactLink}.",
    "contactLinkText": "hier"
  }
}