{
  "footer": {
    "brandName": "BodyState",
    "quickLinks": "Liens rapides",
    "homeLink": "Maison",
    "faqLink": "FAQ",
    "contactLink": "Contactez-nous",
    "appStoreLink": "App Store",
    "legal": "Légal",
    "privacyPolicyLink": "Politique de confidentialité",
    "termsOfServiceLink": "Conditions d'utilisation",
    "connect": "Connecter",
    "twitterLink": "Twitter",
    "instagramLink": "Instagram",
    "tiktokLink": "TikTok",
    "resources": "Ressources",
    "blogLink": "Blog",
    "supportLink": "Soutien",
    "careersLink": "Carrières",
    "copyright": "© {year} BodyState par 2001 Ventures AS. Tous droits réservés.",
    "madeWithLove": "Fait avec ❤️ à {location} par",
    "copyrightShort": "© {year}"
  },
  "header": {
    "brandName": "BodyState",
    "homeLink": "Maison",
    "faqLink": "FAQ",
    "contactLink": "Contactez",
    "downloadButton": "Télécharger"
  },
  "privacyPolicy": {
    "pageTitle": "Politique de confidentialité",
    "h1_1": "Confidentialité",
    "p1_1": "Chez BodyState, nous attachons de l'importance à votre vie privée et nous nous engageons à protéger vos données personnelles. Cette Politique de confidentialité explique comment BodyState collecte, traite et protège vos données en conformité avec les lois sur la confidentialité applicables, y compris le Règlement général sur la protection des données (RGPD).",
    "h2_1": "Principes clés",
    "li1_1": "Aucune information d'identification personnelle (IIP) : BodyState ne collecte ni ne stocke de données permettant de vous identifier directement, telles que des noms, des adresses e-mail ou physiques.",
    "li1_2": "Traitement de données anonymes : Toutes les données collectées sont anonymisées et ne peuvent pas être liées à des individus spécifiques.",
    "li1_3": "Minimisation des données : Nous ne collectons que les données strictement nécessaires pour améliorer les performances et la fonctionnalité de l'application.",
    "li1_4": "Pas de partage de données : Nous ne partageons aucune donnée utilisateur avec des tiers à des fins publicitaires ou autres non fonctionnelles.",
    "h2_2": "1. Données que nous collectons",
    "p2_1": "Nous collectons des données anonymisées dans le but d'assurer la fonctionnalité de l'application, les diagnostics et les analyses de performances. Cela inclut :",
    "h3_2_1": "a. Rapports d'incidents et diagnostics",
    "p2_2": "Outil : Sentry. Objectif : Surveiller les performances de l'application, identifier les incidents et garantir le bon fonctionnement de l'application. Données collectées : Données de diagnostic telles que les journaux d'incidents et les métriques de performances. Anonymisation : Les données collectées par Sentry sont anonymes et ne peuvent pas être liées à des utilisateurs spécifiques. Aucune donnée personnelle n'est collectée ou stockée. Stockage des données : Région de l'UE",
    "h3_2_2": "b. Analytique",
    "p2_3": "Outil : PostHog. Objectif : Analyser les interactions des utilisateurs et améliorer les performances de l'application. Données collectées : Événements d'interaction (par ex., utilisation des fonctionnalités) et métriques de performances. Anonymisation : Toutes les données sont anonymisées ; aucune IIP n'est capturée, stockée ou traitée. Stockage des données : Région de l'UE",
    "h3_2_3": "c. Achats intégrés à l'application",
    "p2_4": "Outil : RevenueCat. Objectif : Gérer les abonnements et les achats intégrés à l'application. Données collectées : Identifiants de l'appareil et détails des achats (par ex., type d'abonnement). Anonymisation : Aucun identifiant personnel (par ex., noms ou e-mails) n'est associé aux données de transaction.",
    "h2_3": "2. Conservation et suppression des données",
    "h3_3_1": "Conservation des données",
    "p3_1": "Toutes les données collectées par BodyState sont anonymisées, agrégées et utilisées uniquement pour améliorer la fonctionnalité de l'application et garantir la stabilité des performances. Ainsi, les données individuelles ne sont conservées que dans la mesure nécessaire à ces fins et conformément aux politiques de conservation de nos services tiers.",
    "h3_3_2": "Suppression des données",
    "p3_2": "Si vous ne souhaitez plus que BodyState collecte ou traite vos données :",
    "p3_3": "Vous pouvez supprimer l'application de votre appareil. La suppression de l'application arrêtera toute collecte de données future, car aucune donnée n'est stockée en dehors des outils tiers intégrés à BodyState.",
    "h2_4": "3. Modifications de cette Politique de confidentialité",
    "p4_1": "Nous pouvons mettre à jour cette Politique de confidentialité de temps à autre pour refléter les changements dans nos pratiques, les exigences légales ou la fonctionnalité de l'application. Toutes les mises à jour seront publiées sur cette page, et la date de \"Dernière mise à jour\" sera révisée en conséquence.",
    "h2_5": "4. Contactez-nous",
    "p5_1": "Si vous avez des questions ou des préoccupations concernant cette Politique de confidentialité ou la manière dont vos données sont traitées, veuillez nous contacter {contactLink}.",
    "contactLinkText": "ici"
  },
  "termsOfService": {
    "pageTitle": "Conditions d'utilisation",
    "h1_1": "Conditions d'utilisation",
    "h2_1": "1. Introduction",
    "p1_1": "Ces Conditions d'utilisation (\"Conditions\") régissent votre utilisation des achats intégrés disponibles dans l'application BodyState (\"Application\"). En effectuant un achat intégré, vous acceptez d'être lié par ces Conditions.",
    "h2_2": "2. Achats intégrés",
    "p2_1": "L'Application propose divers achats intégrés, tels que des thèmes, qui peuvent améliorer votre expérience. Tous les achats intégrés sont des transactions ponctuelles. Une fois un achat effectué, il est non remboursable sauf si la loi l'exige.",
    "h2_3": "3. Fonctionnalité",
    "p3_1": "Si la fonctionnalité d'un achat intégré, comme un thème, est perdue ou perturbée, vous pouvez restaurer votre achat. Pour ce faire, il vous suffit de refaire le processus d'achat et d'utiliser le bouton \"Restaurer les achats\" sur le mur de paiement pour retrouver l'accès sans frais supplémentaires.",
    "h2_4": "4. Licence",
    "p4_1": "Lorsque vous effectuez un achat intégré, vous bénéficiez d'une licence non exclusive, non transférable et révocable pour utiliser le contenu acheté dans l'Application. Cette licence est uniquement à usage personnel et ne confère aucun droit de propriété sur le contenu acheté.",
    "h2_5": "5. Mises à jour et modifications",
    "p5_1": "BodyState se réserve le droit de mettre à jour ou de modifier les achats intégrés, y compris, mais sans s'y limiter, les thèmes, à tout moment. Bien que nous nous efforcions de maintenir la fonctionnalité de tout le contenu acheté, nous ne garantissons pas qu'il restera inchangé ou disponible indéfiniment. Les mises à jour seront fournies sans frais supplémentaires.",
    "h2_6": "6. Résiliation",
    "p6_1": "BodyState se réserve le droit de résilier ou de suspendre votre accès à tout achat intégré si vous violez ces Conditions ou si vous utilisez le contenu de manière non autorisée.",
    "h2_7": "7. Limitation de responsabilité",
    "p7_1": "Dans toute la mesure permise par la loi, BodyState n'est pas responsable des dommages directs, indirects, accessoires ou consécutifs découlant de votre utilisation des achats intégrés, y compris toute perte de fonctionnalité.",
    "h2_8": "8. Loi applicable",
    "p8_1": "Ces Conditions sont régies par les lois de la Norvège et interprétées conformément à celles-ci. Tout litige découlant de ces Conditions sera résolu devant les tribunaux norvégiens.",
    "h2_9": "9. Informations de contact",
    "p9_1": "Si vous avez des questions ou des préoccupations concernant ces Conditions, veuillez nous contacter {contactLink}.",
    "contactLinkText": "ici"
  }
}