{
  "footer": {
    "brandName": "BodyState",
    "quickLinks": "Collegamenti rapidi",
    "homeLink": "Casa",
    "faqLink": "Domande frequenti",
    "contactLink": "Contattaci",
    "appStoreLink": "App Store",
    "legal": "Legale",
    "privacyPolicyLink": "Informativa sulla privacy",
    "termsOfServiceLink": "Termini di servizio",
    "connect": "Collegare",
    "twitterLink": "Twitter",
    "instagramLink": "Instagram",
    "tiktokLink": "TikTok",
    "resources": "Risorse",
    "blogLink": "Blog",
    "supportLink": "Supporto",
    "careersLink": "Carriere",
    "copyright": "© {year} BodyState di 2001 Ventures AS. Tutti i diritti riservati.",
    "madeWithLove": "Fatto con ❤️ a {location} da",
    "copyrightShort": "© {year}",
    "locationNorway": "Norvegia",
    "locationEurope": "Europa"
  },
  "header": {
    "brandName": "BodyState",
    "homeLink": "Casa",
    "faqLink": "Domande frequenti",
    "contactLink": "Contatto",
    "downloadButton": "Scarica"
  },
  "privacyPolicy": {
    "pageTitle": "Informativa sulla privacy",
    "h1_1": "Privacy",
    "p1_1": "In BodyState, valorizziamo la tua privacy e ci impegniamo a proteggere i tuoi dati personali. Questa Informativa sulla privacy spiega come BodyState raccoglie, elabora e protegge i tuoi dati in conformità alle leggi sulla privacy applicabili, tra cui il Regolamento generale sulla protezione dei dati (GDPR).",
    "h2_1": "Principi chiave",
    "li1_1": "Nessuna informazione personalmente identificabile (PII): BodyState non raccoglie o memorizza dati che possono identificarti direttamente, come nomi, indirizzi email o fisici.",
    "li1_2": "Elaborazione dati anonima: Tutti i dati raccolti sono anonimizzati e non possono essere collegati a individui specifici.",
    "li1_3": "Minimizzazione dei dati: Raccogliamo solo i dati strettamente necessari per migliorare le prestazioni e la funzionalità dell'app.",
    "li1_4": "Nessuna condivisione dei dati: Non condividiamo alcun dato degli utenti con terze parti per scopi pubblicitari o non funzionali.",
    "h2_2": "1. Dati che raccogliamo",
    "p2_1": "Raccogliamo dati anonimizzati per le finalità di funzionalità dell'app, diagnostica e analisi delle prestazioni. Questo include:",
    "h3_2_1": "a. Segnalazione di crash e diagnostica",
    "p2_2": "Strumento: Sentry. Scopo: Monitorare le prestazioni dell'app, identificare i crash e garantire che l'app funzioni in modo affidabile. Dati raccolti: Dati diagnostici come log dei crash e metriche delle prestazioni. Anonimizzazione: I dati raccolti da Sentry sono anonimi e non possono essere collegati a utenti specifici. Non vengono raccolti o memorizzati dati personali. Archiviazione dati: Regione UE",
    "h3_2_2": "b. Analisi",
    "p2_3": "Strumento: PostHog. Scopo: Analizzare le interazioni degli utenti e migliorare le prestazioni dell'app. Dati raccolti: Eventi di interazione (ad es. utilizzo delle funzionalità) e metriche delle prestazioni. Anonimizzazione: Tutti i dati sono anonimizzati; non vengono acquisite, memorizzate o elaborate informazioni personali identificative. Archiviazione dati: Regione UE",
    "h3_2_3": "c. Acquisti in-app",
    "p2_4": "Strumento: RevenueCat. Scopo: Gestire abbonamenti e acquisti in-app. Dati raccolti: Identificatori del dispositivo e dettagli degli acquisti (ad es. tipo di abbonamento). Anonimizzazione: Nessun identificatore personale (ad es. nomi o email) è associato ai dati delle transazioni.",
    "h2_3": "2. Conservazione e cancellazione dei dati",
    "h3_3_1": "Conservazione dei dati",
    "p3_1": "Tutti i dati raccolti da BodyState sono anonimizzati, aggregati e utilizzati solo per migliorare la funzionalità dell'app e garantire la stabilità delle prestazioni. Pertanto, i singoli punti dati sono conservati solo per quanto necessario a questi scopi e in conformità con le politiche di conservazione dei servizi di terze parti.",
    "h3_3_2": "Cancellazione dei dati",
    "p3_2": "Se non desideri più che BodyState raccolga o elabori i tuoi dati:",
    "p3_3": "Puoi eliminare l'app dal tuo dispositivo. Eliminando l'app si interromperà la raccolta di dati futuri, poiché nessun dato è memorizzato al di fuori degli strumenti di terze parti integrati in BodyState.",
    "h2_4": "3. Modifiche a questa Informativa sulla privacy",
    "p4_1": "Possiamo aggiornare questa Informativa sulla privacy di volta in volta per riflettere modifiche nelle nostre pratiche, requisiti legali o funzionalità dell'app. Tutti gli aggiornamenti saranno pubblicati su questa pagina e la data dell'\"Ultimo aggiornamento\" sarà rivista di conseguenza.",
    "h2_5": "4. Contattaci",
    "p5_1": "Se hai domande o dubbi su questa Informativa sulla privacy o su come vengono gestiti i tuoi dati, contattaci {contactLink}.",
    "contactLinkText": "qui"
  },
  "termsOfService": {
    "pageTitle": "Termini di servizio",
    "h1_1": "Termini di servizio",
    "h2_1": "1. Introduzione",
    "p1_1": "Questi Termini di servizio (\"Termini\") regolano l'uso degli acquisti in-app disponibili all'interno dell'app BodyState (\"App\"). Effettuando un acquisto in-app, accetti di essere vincolato da questi Termini.",
    "h2_2": "2. Acquisti in-App",
    "p2_1": "L'App offre vari acquisti in-app, come temi, che possono migliorare la tua esperienza. Tutti gli acquisti in-app sono transazioni one-time. Una volta completato un acquisto, non è rimborsabile tranne nei casi previsti dalla legge.",
    "h2_3": "3. Funzionalità",
    "p3_1": "Se la funzionalità di un acquisto in-app, come un tema, viene persa o interrotta, puoi ripristinare il tuo acquisto. Per farlo, basta ripetere il processo di acquisto e utilizzare il pulsante \"Ripristina acquisti\" sulla paywall per ripristinare l'accesso senza alcun costo aggiuntivo.",
    "h2_4": "4. Licenza",
    "p4_1": "Quando effettui un acquisto in-app, ti viene concessa una licenza non esclusiva, non trasferibile, revocabile per utilizzare i contenuti acquistati all'interno dell'App. Questa licenza è solo per uso personale e non conferisce alcun diritto di proprietà sui contenuti acquistati.",
    "h2_5": "5. Aggiornamenti e Modifiche",
    "p5_1": "BodyState si riserva il diritto di aggiornare o modificare gli acquisti in-app, inclusi ma non limitati ai temi, in qualsiasi momento. Sebbene cerchiamo di mantenere la funzionalità di tutti i contenuti acquistati, non garantiamo che rimarrà invariata o disponibile indefinitamente. Gli aggiornamenti saranno forniti senza costi aggiuntivi.",
    "h2_6": "6. Risoluzione",
    "p6_1": "BodyState si riserva il diritto di risolvere o sospendere il tuo accesso a qualsiasi acquisto in-app se violi questi Termini o ti impegni in un uso non autorizzato dei contenuti.",
    "h2_7": "7. Limitazione di Responsabilità",
    "p7_1": "Nella massima misura consentita dalla legge, BodyState non è responsabile per eventuali danni diretti, indiretti, incidentali o consequenziali derivanti dal tuo utilizzo degli acquisti in-app, inclusa qualsiasi perdita di funzionalità.",
    "h2_8": "8. Legge Applicabile",
    "p8_1": "Questi Termini sono disciplinati e interpretati in conformità con le leggi della Norvegia. Eventuali controversie derivanti da questi Termini saranno risolte nei tribunali della Norvegia.",
    "h2_9": "9. Informazioni di Contatto",
    "p9_1": "Se hai domande o dubbi riguardo a questi Termini, contattaci {contactLink}.",
    "contactLinkText": "qui"
  }
}