{
  "footer": {
    "brandName": "BodyState",
    "quickLinks": "빠른 링크",
    "homeLink": "집",
    "faqLink": "자주 묻는 질문",
    "contactLink": "문의하기",
    "appStoreLink": "앱 스토어",
    "legal": "법적",
    "privacyPolicyLink": "개인정보 처리방침",
    "termsOfServiceLink": "서비스 약관",
    "connect": "연결",
    "twitterLink": "트위터",
    "instagramLink": "인스타그램",
    "tiktokLink": "틱톡",
    "resources": "자원",
    "blogLink": "블로그",
    "supportLink": "지원",
    "careersLink": "경력",
    "copyright": "© {year} BodyState by 2001 Ventures AS. 모든 권리 보유.",
    "madeWithLove": "{location}에서 ❤️로 만들어짐:",
    "copyrightShort": "© {year}",
    "locationNorway": "노르웨이",
    "locationEurope": "유럽"
  },
  "header": {
    "brandName": "BodyState",
    "homeLink": "집",
    "faqLink": "자주 묻는 질문",
    "contactLink": "연락하기",
    "downloadButton": "다운로드"
  },
  "privacyPolicy": {
    "pageTitle": "개인정보 보호정책",
    "h1_1": "개인정보",
    "p1_1": "BodyState에서는 귀하의 개인정보를 중요하게 생각하며 귀하의 개인 데이터를 보호하기 위해 최선을 다하고 있습니다. 본 개인정보 보호정책은 BodyState가 적용 가능한 개인정보 보호 법률, 특히 일반 데이터 보호 규정(GDPR)을 준수하여 귀하의 데이터를 수집, 처리 및 보호하는 방법을 설명합니다.",
    "h2_1": "주요 원칙",
    "li1_1": "개인 식별 정보(PII) 없음: BodyState는 이름, 이메일 주소 또는 실제 주소와 같이 귀하를 직접 식별할 수 있는 데이터를 수집하거나 저장하지 않습니다.",
    "li1_2": "익명 데이터 처리: 수집된 모든 데이터는 익명화되어 특정 개인과 연결할 수 없습니다.",
    "li1_3": "데이터 최소화: 앱 성능 및 기능을 개선하는 데 꼭 필요한 데이터만을 수집합니다.",
    "li1_4": "데이터 공유 없음: 광고 또는 기능 외적인 목적을 위해 사용자 데이터를 제3자와 공유하지 않습니다.",
    "h2_2": "1. 수집하는 데이터",
    "p2_1": "앱 기능, 진단 및 성능 분석 목적으로 익명화된 데이터를 수집합니다. 이는 다음을 포함합니다:",
    "h3_2_1": "a. 충돌 보고 및 진단",
    "p2_2": "도구: Sentry. 목적: 앱 성능 모니터링, 충돌 식별 및 안정적인 앱 운영 보장. 수집된 데이터: 충돌 로그 및 성능 지표와 같은 진단 데이터. 익명화: Sentry에 의해 수집된 데이터는 익명화되어 특정 사용자와 연결할 수 없습니다. 개인 데이터는 수집되거나 저장되지 않습니다. 데이터 저장: EU 지역",
    "h3_2_2": "b. 분석",
    "p2_3": "도구: PostHog. 목적: 사용자 상호작용을 분석하고 앱 성능을 개선하기 위함. 수집된 데이터: 상호작용 이벤트(예: 기능 사용) 및 성능 지표. 익명화: 모든 데이터는 익명화되며 개인 식별 정보는 캡처, 저장 또는 처리되지 않습니다. 데이터 저장: EU 지역",
    "h3_2_3": "c. 앱 내 구매",
    "p2_4": "도구: RevenueCat. 목적: 구독 및 앱 내 구매 관리. 수집된 데이터: 장치 식별자 및 구매 세부 정보(예: 구독 유형). 익명화: 거래 데이터에는 이름 또는 이메일과 같은 개인 식별자가 연관되어 있지 않습니다.",
    "h2_3": "2. 데이터 보유 및 삭제",
    "h3_3_1": "데이터 보유",
    "p3_1": "BodyState가 수집한 모든 데이터는 익명화되어 집계되며 앱 기능을 개선하고 성능 안정성을 보장하는 데에만 사용됩니다. 따라서 개별 데이터 포인트는 이러한 목적을 위해 필요한 만큼만 보관되며 제3자 서비스의 보관 정책에 따라 보관됩니다.",
    "h3_3_2": "데이터 삭제",
    "p3_2": "BodyState가 귀하의 데이터를 더 이상 수집하거나 처리하지 않기를 원하는 경우:",
    "p3_3": "장치에서 앱을 삭제할 수 있습니다. 앱을 삭제하면 BodyState에 통합된 제3자 도구 외에는 데이터가 저장되지 않으므로 향후 데이터 수집이 중지됩니다.",
    "h2_4": "3. 개인정보 보호정책 변경",
    "p4_1": "저희는 실천 방침, 법적 요구 사항 또는 앱 기능의 변경을 반영하기 위해 개인정보 보호정책을 수시로 업데이트할 수 있습니다. 모든 업데이트는 이 페이지에 게시되며 \"최근 업데이트\" 날짜가 그에 따라 수정됩니다.",
    "h2_5": "4. 문의하기",
    "p5_1": "본 개인정보 보호정책 또는 귀하의 데이터 처리 방법에 대한 질문이나 우려 사항이 있으시면 {contactLink}로 문의해주시기 바랍니다.",
    "contactLinkText": "여기"
  },
  "termsOfService": {
    "pageTitle": "서비스 약관",
    "h1_1": "서비스 약관",
    "h2_1": "1. 소개",
    "p1_1": "이 서비스 약관(\"약관\")은 BodyState 앱(\"앱\") 내에서 제공되는 인앱 구매의 사용을 규제합니다. 인앱 구매를 하면 이 약관에 동의하는 것으로 간주됩니다.",
    "h2_2": "2. 인앱 구매",
    "p2_1": "앱은 테마와 같은 다양한 인앱 구매를 제공하여 사용자 경험을 향상시킬 수 있습니다. 모든 인앱 구매는 일회성 거래입니다. 구매가 완료되면 법률에 따라 그 외에는 환불이 불가능합니다.",
    "h2_3": "3. 기능",
    "p3_1": "인앱 구매(예: 테마)의 기능이 손실되거나 중단된 경우 구매를 복원할 수 있습니다. 이를 위해 구매 프로세스를 다시 진행하고, 결제 창에서 \"구매 복원\" 버튼을 사용하여 추가 요금 없이 액세스를 회복할 수 있습니다.",
    "h2_4": "4. 라이선스",
    "p4_1": "인앱 구매를 하면 구매한 콘텐츠를 앱 내에서 사용할 수 있는 비독점적이고 양도할 수 없는 취소 가능한 라이선스가 부여됩니다. 이 라이선스는 개인적인 용도로만 사용할 수 있으며 구매한 콘텐츠에 대한 소유권을 제공하지 않습니다.",
    "h2_5": "5. 업데이트 및 수정",
    "p5_1": "BodyState는 테마를 비롯한 인앱 구매를 언제든지 업데이트하거나 수정할 수 있는 권리를 보유합니다. 모든 구매한 콘텐츠의 기능을 유지하려 노력하지만 변경되거나 영구적으로 이용할 수 없을 수 있다는 것을 보장하지 않습니다. 업데이트는 추가 비용 없이 제공됩니다.",
    "h2_6": "6. 해지",
    "p6_1": "BodyState는 이 약관을 위반하거나 콘텐츠의 무단 사용에 가담한 경우 언제든지 인앱 구매에 대한 액세스를 해지하거나 중지할 권리를 보유합니다.",
    "h2_7": "7. 책임 한계",
    "p7_1": "법률이 허용하는 한도 내에서, BodyState는 인앱 구매 사용으로 인한 직접, 간접, 부수적인 손해에 대해 책임을 지지 않습니다.",
    "h2_8": "8. 준거법",
    "p8_1": "이 약관은 노르웨이 법률에 따라 해석되고 규정됩니다. 이 약관에서 발생하는 분쟁은 노르웨이의 법원에서 해결됩니다.",
    "h2_9": "9. 연락처",
    "p9_1": "이 약관에 관한 질문이나 문의 사항이 있으시면 {contactLink}로 문의해주십시오.",
    "contactLinkText": "여기"
  }
}