{
  "footer": {
    "brandName": "BodyState",
    "quickLinks": "Links Rápidos",
    "homeLink": "Casa",
    "faqLink": "Perguntas frequentes",
    "contactLink": "Entre em contato conosco.",
    "appStoreLink": "App Store",
    "legal": "Legal",
    "privacyPolicyLink": "Política de Privacidade",
    "termsOfServiceLink": "Termos de Serviço",
    "connect": "Conectar",
    "twitterLink": "Twitter",
    "instagramLink": "Instagram",
    "tiktokLink": "TikTok",
    "resources": "Recursos",
    "blogLink": "Blog",
    "supportLink": "Apoio",
    "careersLink": "Carreiras",
    "copyright": "© {year} BodyState por 2001 Ventures AS. Todos os direitos reservados.",
    "madeWithLove": "Feito com ❤️ em {location} por",
    "copyrightShort": "© {year}"
  },
  "header": {
    "brandName": "BodyState",
    "homeLink": "Casa",
    "faqLink": "Perguntas frequentes",
    "contactLink": "Contato",
    "downloadButton": "Baixar"
  },
  "privacyPolicy": {
    "pageTitle": "Política de Privacidade",
    "h1_1": "Privacidade",
    "p1_1": "Na BodyState, valorizamos a sua privacidade e comprometemo-nos a proteger os seus dados pessoais. Esta Política de Privacidade explica como a BodyState recolhe, processa e protege os seus dados em conformidade com as leis de privacidade aplicáveis, incluindo o Regulamento Geral de Proteção de Dados (RGPD).",
    "h2_1": "Princípios Chave",
    "li1_1": "Nenhuma Informação Pessoal Identificável (PII): A BodyState não recolhe nem armazena quaisquer dados que possam identificá-lo diretamente, como nomes, endereços de e-mail ou físicos.",
    "li1_2": "Processamento de Dados Anónimos: Todos os dados recolhidos são anonimizados e não podem ser associados a indivíduos específicos.",
    "li1_3": "Minimização de Dados: Recolhemos apenas os dados estritamente necessários para melhorar o desempenho e a funcionalidade do aplicativo.",
    "li1_4": "Sem Partilha de Dados: Não partilhamos quaisquer dados do utilizador com terceiros para publicidade ou outros fins não funcionais.",
    "h2_2": "1. Dados que Recolhemos",
    "p2_1": "Recolhemos dados anonimizados para os fins de funcionalidade do aplicativo, diagnóstico e análise de desempenho. Isto inclui:",
    "h3_2_1": "a. Relatórios de Falhas e Diagnósticos",
    "p2_2": "Ferramenta: Sentry. Propósito: Monitorizar o desempenho do aplicativo, identificar falhas e garantir que o aplicativo funcione de forma fiável. Dados Recolhidos: Dados de diagnóstico como registos de falhas e métricas de desempenho. Anonimização: Os dados recolhidos pelo Sentry são anónimos e não podem ser associados a utilizadores específicos. Não são recolhidos nem armazenados dados pessoais. Armazenamento de Dados: Região da UE",
    "h3_2_2": "b. Análises",
    "p2_3": "Ferramenta: PostHog. Propósito: Analisar interações do utilizador e melhorar o desempenho do aplicativo. Dados Recolhidos: Eventos de interação (por exemplo, utilização de funcionalidades) e métricas de desempenho. Anonimização: Todos os dados são anonimizados; não são capturadas, armazenadas ou processadas informações pessoais identificáveis. Armazenamento de Dados: Região da UE",
    "h3_2_3": "c. Compras na Aplicação",
    "p2_4": "Ferramenta: RevenueCat. Propósito: Gerir subscrições e compras na aplicação. Dados Recolhidos: Identificadores de dispositivo e detalhes de compra (por exemplo, tipo de subscrição). Anonimização: Não são associados identificadores pessoais (por exemplo, nomes ou e-mails) aos dados de transação.",
    "h2_3": "2. Retenção e Eliminação de Dados",
    "h3_3_1": "Retenção de Dados",
    "p3_1": "Todos os dados recolhidos pela BodyState são anonimizados, agregados e utilizados apenas para melhorar a funcionalidade do aplicativo e garantir a estabilidade do desempenho. Como tal, os pontos de dados individuais são retidos apenas conforme necessário para estes fins e de acordo com as políticas de retenção dos nossos serviços de terceiros.",
    "h3_3_2": "Eliminação de Dados",
    "p3_2": "Se já não deseja que a BodyState recolha ou processe os seus dados:",
    "p3_3": "Pode eliminar o aplicativo do seu dispositivo. A eliminação do aplicativo interromperá toda a recolha de dados futura, uma vez que nenhum dado é armazenado fora das ferramentas de terceiros integradas na BodyState.",
    "h2_4": "3. Alterações a Esta Política de Privacidade",
    "p4_1": "Podemos atualizar esta Política de Privacidade de tempos a tempos para refletir alterações nas nossas práticas, requisitos legais ou funcionalidades do aplicativo. Todas as atualizações serão publicadas nesta página, e a data de \"Última Atualização\" será revista em conformidade.",
    "h2_5": "4. Contacte-nos",
    "p5_1": "Se tiver alguma dúvida ou preocupação sobre esta Política de Privacidade ou sobre como os seus dados são tratados, entre em contacto connosco {contactLink}.",
    "contactLinkText": "aqui"
  },
  "termsOfService": {
    "pageTitle": "Termos de Serviço",
    "h1_1": "Termos de Serviço",
    "h2_1": "1. Introdução",
    "p1_1": "Estes Termos de Serviço (\"Termos\") regem o seu uso de compras dentro do aplicativo disponíveis no aplicativo BodyState (\"App\"). Ao fazer uma compra dentro do aplicativo, você concorda em ficar vinculado a estes Termos.",
    "h2_2": "2. Compras Dentro do Aplicativo",
    "p2_1": "O App oferece várias compras dentro do aplicativo, como temas, que podem melhorar sua experiência. Todas as compras dentro do aplicativo são transações únicas. Uma vez que uma compra é concluída, ela não é reembolsável, exceto quando exigido por lei.",
    "h2_3": "3. Funcionalidade",
    "p3_1": "Se a funcionalidade de uma compra dentro do aplicativo, como um tema, for perdida ou interrompida, você pode restaurar sua compra. Para fazer isso, basta passar pelo processo de compra novamente e usar o botão \"Restaurar Compras\" na tela de pagamento para recuperar o acesso sem custo adicional.",
    "h2_4": "4. Licença",
    "p4_1": "Ao fazer uma compra dentro do aplicativo, você recebe uma licença não exclusiva, não transferível e revogável para usar o conteúdo adquirido dentro do App. Esta licença é apenas para uso pessoal e não concede quaisquer direitos de propriedade sobre o conteúdo adquirido.",
    "h2_5": "5. Atualizações e Modificações",
    "p5_1": "A BodyState reserva o direito de atualizar ou modificar compras dentro do aplicativo, incluindo, mas não se limitando a temas, a qualquer momento. Embora nos esforcemos para manter a funcionalidade de todo o conteúdo adquirido, não garantimos que ele permanecerá inalterado ou disponível indefinidamente. As atualizações serão fornecidas sem custo adicional.",
    "h2_6": "6. Rescisão",
    "p6_1": "A BodyState reserva o direito de rescindir ou suspender seu acesso a quaisquer compras dentro do aplicativo se você violar estes Termos ou se envolver em uso não autorizado do conteúdo.",
    "h2_7": "7. Limitação de Responsabilidade",
    "p7_1": "Na máxima extensão permitida por lei, a BodyState não é responsável por quaisquer danos diretos, indiretos, incidentais ou consequentes decorrentes do seu uso de compras dentro do aplicativo, incluindo qualquer perda de funcionalidade.",
    "h2_8": "8. Lei Aplicável",
    "p8_1": "Estes Termos são regidos e interpretados de acordo com as leis da Noruega. Quaisquer disputas decorrentes destes Termos serão resolvidas nos tribunais da Noruega.",
    "h2_9": "9. Informações de Contato",
    "p9_1": "Se você tiver alguma dúvida ou preocupação sobre estes Termos, entre em contato conosco {contactLink}.",
    "contactLinkText": "aqui"
  }
}