{
  "footer": {
    "brandName": "BodyState",
    "quickLinks": "Snabblänkar",
    "homeLink": "Hem",
    "faqLink": "Vanliga frågor",
    "contactLink": "Kontakta oss",
    "appStoreLink": "App Store",
    "legal": "Laglig",
    "privacyPolicyLink": "Integritetspolicy",
    "termsOfServiceLink": "Användarvillkor",
    "connect": "Anslut",
    "twitterLink": "Twitter",
    "instagramLink": "Instagram",
    "tiktokLink": "TikTok",
    "resources": "Resurser",
    "blogLink": "Blogg",
    "supportLink": "Stöd",
    "careersLink": "Karriärer",
    "copyright": "© {year} BodyState av 2001 Ventures AS. Alla rättigheter förbehållna.",
    "madeWithLove": "Gjord med ❤️ i {location} av",
    "copyrightShort": "© {year}",
    "locationNorway": "Norge",
    "locationEurope": "Europa"
  },
  "header": {
    "brandName": "BodyState",
    "homeLink": "Hem",
    "faqLink": "Vanliga frågor",
    "contactLink": "Kontakt",
    "downloadButton": "Ladda ner"
  },
  "privacyPolicy": {
    "pageTitle": "Integritetspolicy",
    "h1_1": "Integritet",
    "p1_1": "På BodyState värderar vi din integritet och är engagerade i att skydda dina personuppgifter. Denna integritetspolicy förklarar hur BodyState samlar in, behandlar och skyddar dina data i enlighet med tillämpliga integritetslagar, inklusive den allmänna dataskyddsförordningen (GDPR).",
    "h2_1": "Nyckelprinciper",
    "li1_1": "Ingen personligt identifierbar information (PII): BodyState samlar inte in eller lagrar några data som direkt kan identifiera dig, såsom namn, e-postadresser eller fysiska adresser.",
    "li1_2": "Anonym datahantering: All data som samlas in är anonymiserad och kan inte kopplas till specifika individer.",
    "li1_3": "Data-minimering: Vi samlar endast in data som är strikt nödvändig för att förbättra appens prestanda och funktionalitet.",
    "li1_4": "Ingen datadelning: Vi delar inte användardata med tredje parter för reklam eller andra icke-funktionella ändamål.",
    "h2_2": "1. Data Vi Samlar In",
    "p2_1": "Vi samlar in anonymiserad data för ändamålen appfunktionalitet, diagnostik och prestandaanalys. Detta inkluderar:",
    "h3_2_1": "a. Kraschrapportering och Diagnostik",
    "p2_2": "Verktyg: Sentry. Syfte: Att övervaka appens prestanda, identifiera krascher och säkerställa att appen fungerar pålitligt. Data som samlas in: Diagnostikdata såsom kraschloggar och prestandametrik. Anonymisering: Data som samlas in av Sentry är anonym och kan inte kopplas till specifika användare. Inga personuppgifter samlas in eller lagras. Dataförvaring: EU-regionen",
    "h3_2_2": "b. Analys",
    "p2_3": "Verktyg: PostHog. Syfte: Att analysera användarinteraktioner och förbättra appens prestanda. Data som samlas in: Interaktionshändelser (t.ex. funktionsanvändning) och prestandametrik. Anonymisering: All data är anonymiserad; ingen PII fångas, lagras eller bearbetas. Dataförvaring: EU-regionen",
    "h3_2_3": "c. In-App Köp",
    "p2_4": "Verktyg: RevenueCat. Syfte: Att hantera prenumerationer och in-app köp. Data som samlas in: Enhetens identifierare och köpdetaljer (t.ex. prenumerationstyp). Anonymisering: Inga personliga identifierare (t.ex. namn eller e-post) är associerade med transaktionsdata.",
    "h2_3": "2. Data Lagring och Radering",
    "h3_3_1": "Data Lagring",
    "p3_1": "All data som samlas in av BodyState är anonymiserad, aggregerad och används endast för att förbättra appens funktionalitet och säkerställa prestandastabilitet. Individuella datapunkter behålls endast så länge som det är nödvändigt för dessa ändamål och i enlighet med de lagringspolicyer som gäller för våra tredjepartstjänster.",
    "h3_3_2": "Data Radering",
    "p3_2": "Om du inte längre önskar att BodyState ska samla in eller behandla dina data:",
    "p3_3": "Du kan ta bort appen från din enhet. Att ta bort appen kommer att stoppa all framtida datainsamling, eftersom ingen data lagras utanför de tredjepartsverktyg som är integrerade i BodyState.",
    "h2_4": "3. Ändringar i Denna Integritetspolicy",
    "p4_1": "Vi kan uppdatera denna Integritetspolicy från tid till annan för att återspegla förändringar i våra metoder, lagkrav eller appfunktionalitet. Alla uppdateringar kommer att publiceras på denna sida, och datumet för \"Senast Uppdaterad\" kommer att revideras därefter.",
    "h2_5": "4. Kontakta Oss",
    "p5_1": "Om du har några frågor eller funderingar angående denna Integritetspolicy eller hur dina data hanteras, vänligen kontakta oss {contactLink}.",
    "contactLinkText": "här"
  },
  "termsOfService": {
    "pageTitle": "Användarvillkor",
    "h1_1": "Användarvillkor",
    "h2_1": "1. Introduktion",
    "p1_1": "Dessa användarvillkor (\"Villkor\") styr din användning av köp i appen tillgängliga inom BodyState-appen (\"App\"). Genom att göra ett köp i appen samtycker du till att vara bunden av dessa Villkor.",
    "h2_2": "2. Köp i Appen",
    "p2_1": "Appen erbjuder olika köp i appen, såsom teman, som kan förbättra din upplevelse. Alla köp i appen är engångstransaktioner. När ett köp är slutfört är det ej återbetalningsbart förutom där det krävs enligt lag.",
    "h2_3": "3. Funktionalitet",
    "p3_1": "Om funktionaliteten hos ett köp i appen, såsom ett tema, går förlorad eller störs, kan du återställa ditt köp. För att göra detta, gå helt enkelt igenom köpprocessen igen och använd knappen \"Återställ köp\" på betalväggen för att återfå åtkomst utan någon extra kostnad.",
    "h2_4": "4. Licens",
    "p4_1": "När du gör ett köp i appen beviljas du en icke-exklusiv, icke-överförbar, återkallelig licens att använda det köpta innehållet inom Appen. Denna licens är endast för personligt bruk och ger inga äganderättigheter till det köpta innehållet.",
    "h2_5": "5. Uppdateringar och Ändringar",
    "p5_1": "BodyState förbehåller sig rätten att uppdatera eller ändra köp i appen, inklusive men inte begränsat till teman, när som helst. Även om vi strävar efter att bibehålla funktionaliteten hos allt köpt innehåll, garanterar vi inte att det kommer förbli oförändrat eller tillgängligt obegränsat. Uppdateringar kommer att tillhandahållas utan extra kostnad.",
    "h2_6": "6. Uppsägning",
    "p6_1": "BodyState förbehåller sig rätten att avsluta eller suspendera din åtkomst till några köp i appen om du bryter mot dessa Villkor eller ägnar dig åt obehörig användning av innehållet.",
    "h2_7": "7. Ansvarsbegränsning",
    "p7_1": "I den utsträckning som är tillåten enligt lag, är inte BodyState ansvarig för några direkta, indirekta, incidentella eller följdsamma skador som uppstår från din användning av köp i appen, inklusive eventuell förlust av funktionalitet.",
    "h2_8": "8. Tillämplig Lag",
    "p8_1": "Dessa Villkor regleras av och tolkas i enlighet med Norges lagar. Eventuella tvister som uppstår från dessa Villkor kommer att lösas i Norges domstolar.",
    "h2_9": "9. Kontaktinformation",
    "p9_1": "Om du har några frågor eller funderingar angående dessa Villkor, vänligen kontakta oss {contactLink}.",
    "contactLinkText": "här"
  }
}